{
  "posts": [
    {
      "id": 1,
      "title": "Чем Россия может ответить на «драконовские» санкции США?",
      "userId": 1,
      "paragraphs": [
        "И вот под очередным дурацким, надуманным и никем не доказанным предлогом США вводят очередные, но уже теперь \"драконовские\" санкции. Когда в санкционные списки вносили каких то чиновников, олигархов, бизнесменов и высылали дипломатов - это было не \"больно\" для всех остальных. Когда начали ограничивать деятельность крупных компаний - это тоже можно купировать дифференциацией рынков сбыта и минимизировать потери. Власти ждали, молчали и практически ничего не делали. Но теперь то понятно, что никто не планирует останавливаться и этот курс надолго. Зачем тешить себя иллюзиями, что не стоит перегибать палку, что все само собой рассосется. Хотим выглядеть красиво и цивилизовано? А надо ли?",
        "Вот сейчас санкции включают в себя полный запрет на экспорт электронных устройств (подведя их под двойное назначение) - это уже такой приличный такой удар. А чем можем ответить мы?",
        "Обычно на этом месте говорят, что мы можем либо \"выстрелить себе в ногу\" запретив поставки титана, урана или ракетных двигателей. Либо сделать что то совсем несущественное для США.",
        "Однако и у нас есть в запасе хороший ответный ход для санкций...",
        "Вот Европа уверенно отбивается от санкций США которые ей не выгодны. Они приняли так называемый \"блокирующий статут\" запрещает европейским компаниям подчиняться санкционным мерам, которые влекут за собой нарушение санкций США, а европейским судам - обязывать компании соблюдать эти меры. Также статут предусматривает возможность присуждения компенсации компаниям, пострадавшим от санкций США."
      ]
    },
    {
      "id": 2,
      "title": "Крымские власти больше не могут игнорировать экологическую катастрофу в Армянске",
      "userId": 2,
      "paragraphs": [
        "Трубить тревогу жители начали больше недели назад, но до реальных действий дошло только сегодня: \"Крымский титан\" остановлен по указанию Аксенова, а детей эвакуируют в санатории.",
        "В первые дни проблему вообще \"не замечали\", химические предприятия, которых здесь всего три, дружно делали большие глаза: \"Это не мы!\", а власти только разводили руками: \"А кто это сделал?\"",
        "Крымские СМИ не переставали писать о нарастающей проблеме, от властей шли невнятные ответы о загадочности происходящего и за целую неделю (!) так и не нашли (!!) причину и источник полномасштабного экологического ЧП.",
        "Все началось с того, что на утро 25 августа жители Армянска, что на севере Крыма с удивлением обнаружили, что все металлические предметы в городе покрылись липкой ржавчиной. И те, что располагаются на улице, и находящиеся в квартирах и домах! Не у кого-то одного во дворе, а по всему городу, только вдумайтесь! Ручки дверей, ключи, решетки, лестницы, автомобили, велосипеды, даже чайники и хлебницы.",
        "Жителям города официально предложили \"сидеть дома\", пообещали разобраться и отправили в город комиссию. Которая ... ничего необычного не обнаружила.",
        "Прошло еще пару дней, многие стали жаловаться на плохое самочувствие, першение в горле. В социальных сетях появились фото детей с красной сыпью, в городе с растений и деревьев начали осыпаться зелёные листья."
      ]
    },
    {
      "id": 3,
      "title": "Telegram согласился выдавать спецслужбам IP-адреса и номера пользователей",
      "userId": 3,
      "paragraphs": [
        "Мессенджер Telegram обновил свою политику конфиденциальности, добавив в правила возможность передачи данных пользователей спецслужбам.",
        "Согласно новому пункту 8.3, мессенджер сможет передавать властям IP-адрес и номер телефона пользователя на основании судебного распоряжения, которое подтверждает, что этого пользователя подозревают в терроризме.",
        "Отмечается, что на сегодняшний день подобных ситуаций не было. Если такое случится, Telegram обещает сообщать об этом в полугодовом отчете, который будет опубликован в специальном канале — @Transparency. ",
        "В Роскомнадзоре заявили, что блокировка Telegram пока продолжается и прекратится только по решению ФСБ. В ведомстве уточнили, что возможность разблокировки рассмотрят после выполнения требования предоставить ключи для расшифровки сообщений, и посоветовали мессенджеру «перейти от публичных заявлений к взаимодействию с ФСБ». ",
        "В апреле Таганский районный суд Москвы удовлетворил иск Роскомнадзора о блокировке Telegram после отказа мессенджера передать ФСБ ключи для расшифровки сообщений пользователей. Представители Telegram настаивали, что исполнить это требование технически невозможно, в Роскомнадзоре это называли лукавством. ",
        "Летом 2017 года основатель Telegram Павел Дуров, комментируя требования ФСБ передать ключи для расшифровки сообщений, заявил, что «ни один байт персональных данных никогда не будет передан ни одному правительству»."
      ]
    },
    {
      "id": 4,
      "title": "Новохохловская - на Курском направлении появилась новая станция",
      "userId": 1,
      "paragraphs": [
        "В отличие от станций метро, открытия в Москве нового остановочного пункта железной дороги (если не считать МЦК) случаются не так часто. Как раз сегодня такой случай - на Курском направлении открылась станция Новохохловская",
        "Главная идея (собственно, ради чего всё и строилось) - это пересадка на одноимённую станцию МЦК, т.к. ближайшая отсюда платформа (Калитники) находится на отдалении. Формально, Новохохловская — не станция, а остановочный пункт. Но я сторонник того, что пассажиру этого знать не нужно: для него —  всё станции, и это правильно",
        "1. Сама платформа оборудована навесом во всю длину платформы. Около каждого пути висят табло с временем прибытия ближайших поездов",
        "2. Вход и выход осуществляются через крытый мо",
        "3. Наверху кассовый зал, турникеты, билетные автоматы",
        "4. Наверх как с платформы, так и с улицы, ведут не только лестницы, но и лифты с эскалаторами",
        "5. Что приятно удивляет - несмотря на традиционное оформление в стиле РЖД, станция всё равно имеет собственное лицо",
        "6. Ещё из креативного - скамейки выполнены в виде букв названия станции. Правда, за счёт его длины, в одну линию скамейки не влезли",
        "7. Широкий турникет, для маломобильных пассажиров расположен не сбоку, как обычно, а в середине - напротив лифта, что очень удобно",
        "8. В общем, станция получилась довольно симпатичной. Но самое главное - удобная пересадка"
      ]
    },
    {
      "id": 5,
      "title": "Рождественские открытки с городскими пейзажами украсят Москву в январе!",
      "userId": 2,
      "paragraphs": [
        "На остановках, билбордах, стендах с афишами и digital-экранах появится 600 поздравлений для горожан. Основой для открыток станут картины художника Игоря Разживина с изображенными на них московскими церквями.",
        "Рождественские открытки начнут появляться на улицах Москвы с 1 января. До сочельника весь город украсят 600 поздравительных плакатов, афиш, стикеров, баннеров и цифровых открыток. Их разместят на остановках общественного транспорта, в витринах магазинов, на билбордах вдоль дорог, стендах с афишами и медиаэкранах.",
        "В праздничном оформлении будут использованы зимние пейзажи московского художника Игоря Разживина. Среди них такие картины, как «Зимняя сказка», «Волшебница зима», «Мороз снежком укутывал», «Сияющий снег», «Декабрьский вечер».",
        "«В основном это виды на городские церкви. На открытках изображены собор Василия Блаженного, Богоявленский кафедральный собор, церковь Усекновения Главы Иоанна Предтечи на Пятницкой улице, храм Святителя Григория Неокесарийского на Большой Полянке, а также дворцово-парковый ансамбль “Царицыно”. На каждом поздравительном плакате будет надпись “С Рождеством Христовым!” и бело-синие цифры 2018», — сообщили в пресс-службе Департамента средств массовой информации и рекламы города Москвы.",
        "В ведомстве отметили, что рождественские поздравления останутся на городских улицах до 14 января.",
        "Оформлять город к Новому году начнут в середине декабря. На праздничных плакатах москвичи и гости столицы увидят главные достопримечательности. Это Красная площадь, собор Василия Блаженного, Большой театр и другие. Всего к Новому году столицу украсят около тысячи праздничных открыток."
      ]
    },
    {
      "id": 6,
      "title": "Диалоги",
      "userId": 3,
      "paragraphs": [
        "Размер Москвы несопоставим с длительностью тёплых сезонов – я плохо знаю Город, хотя за два последних года познакомился с ним ближе, чем за предпоследние 16. ",
        "Гуляю-«автопилочу» или гляжу на себя в телефоне со спутника; предполагаю, догадываюсь или ошибаюсь; разглядываю или бравирую архитектурно-закуточными знаниями. ",
        "Браслет считает мои шаги, а я читаю диалоги.",
        "Щёлкают нейроны места - и я вспоминаю события и диалоги, чей срок годности давно истек, либо и не начинался вовсе.",
        "В людском гомоне и дребезжании урбана или в тишине спящего жителями Города я чувствую ментальный аудиослед: диалоги за витринами кафе, на парковках и зебрах, мостах и лестницах, у дверей магазинов, в кинотеатрах и скверах. ",
        "Давно эти люди не рядом, но до сих пор я слышу тактические и стратегические совещания, размышления с прищуром и блуждающим взглядом, трёп и балагурство, упрёки в глаза и томный шёпот в ухо.",
        "«Я прекрасно научился говорить сам с собой за десять лет. Жизнь тем и хороша, что один собеседник у тебя всегда найдётся», - писал Лукьяненко.",
        "Я помню мысли, многовариативность внутренних диалогов, я помню, как отказывался, как недоумевал, прозревал и решался.",
        "Город хранит несметное число слов и фраз, восклицания и вопросов вне зависимости от моего желания помнить-видеть или забыть-разрушить.",
        "Менять его на неисписанный не хочу. Хочу если не затереть старые, то хотя бы увидеть поверх новые – красочные и до улыбки светлые – диалоги. Записанные новыми людьми."
      ]
    },
    {
      "id": 7,
      "title": "Самый обычный выходной в Нью-Йорке",
      "userId": 1,
      "paragraphs": [
        "Привет, меня зовут Яша и я живу в Нью-Йорке. Как-то я вам рассказывал про пару своих рабочих дней в родном городе — Самый обычный день в Нью-Йорке — и — Еще один самый обычный день в Нью-Йорке. А еще я рассказывал вам про Один день туриста в Калькутте.",
        "В этот раз, расскажу про свой самый обычный Нью-Йоркский выходной — в котором фигурируют жара, друзья, пирожки, кошки и почти совсем не фигурирует Дженнифер Лопес. В общем, самая обычная суббота, 13 июля 2018 года.",
        "Пол-десятого утра. Звонит будильник. Не мой — жены. Она работает по субботам. Жена встаёт и шкандыбает в туалет. Я продолжаю дремать.",
        "9:55 утра. Открываю глаза — жена уже одета. - Блин, говорит, думала прокрасться незаметно, сорри, разбудила тебя.",
        "- Ничего страшного, говорю. - и выскакиваю из кровати, - дай мне две минуты — отлить и плеснуть на лицо холодной из крана — и я тебя провожу. - Да ладно, спал бы себе, - ворчит она, - у тебя-ж выходной, мог бы спать и спать... Кормлю котов. Их у нас три штуки.",
        "Выходим из дома в жаркое, июльское утро. Холли, моя жена, уныло шаркает сандалиями, а я бодр и весел. Иду, насвистываю. Нет ничего лучше, чем провожать любимого человека на работу, когда у самого спереди маячит такой огромный выходной. Поэтому, кстати, Холли и не любит чтобы я провожал на метро. И так тошно, а еще и этот тут насвистывает.",
        "У интернетной станции сидит молодой парень, без определенного места жительства. На коленях его — голова подруги. Из белой простынки еле видно измождённое лицо, усталые глаза. Парень смотрит на подругу как Мадонна из Пьеты. О, как можно оценить степень любви и нежности в его взгляде?"
      ]
    },
    {
      "id": 8,
      "title": "ОДИН МОЙ ОБЫЧНЫЙ ДУБАЙСКИЙ БУДЕНЬ",
      "userId": 2,
      "paragraphs": [
        "Всем привет из солнечного Дубая! Наверно кто-то меня помнит, я Настя, 32, и это мой я уже сбилась со счету какой день в сообществе. Обычно мои посты про жизнь в Дубае огребают много противоречивых комментариев, что, впрочем, не останавливает мои попытки разбить клише и снять с этого города ярлыки гламурности и роскошности. Я показываю свою обычную жизнь и работу. Кому интересно - прошу под кат :)",
        "1. Я просыпаюсь в 6 утра, но в постели с мужем так хорошо, а тут еще кот затеплился под бочок, что встать оттуда совершенно невозможно! Приходится лежать и урчать с ними! В итоге поднимаю свое туловище только к 7 утра... Разленилась, мать! А ну пошла быстро делать зарядку!",
        "2. Иду на террасу снимать полотенца. Не смотря на 40-градусную жару, белье сохнет плохо из-за супер-высокой влажности, особенно тяжко приходится махровым полотенцам. Зато цветы себя чувствуют прекрасно при таком содержании воды в воздухе!",
        "3. Перед завтраком навожу порядок на кухне. Вообще-то у нас студия, поэтому название \"кухня\" совершенно условное, особенно если учесть, что у нас нет плиты...",
        "4. Утреннее приготовление пищи. На завтрак свежий йогурт с черникой и бабушкиным малиновым вареньем. Справа мой обед на работу: кускус с курицей и луком-пореем. ",
        "5. Глажу мужу рубашку. В Дубае обычно все пользуются услугами прачечных, которые и гладят тоже. Но я по старинке - стираю и глажу сама.",
        "6. Кто знает сколько средств нужно применить чтобы ваш макияж был \"незаметным\"?))) Шутка, но правда. Я пытаюсь научиться жить без макияжа, но пока получается только в выходные. Недавно прочитала на Линкедине историю одной девушки, которая полностью отказалась от макияжа на работу, и абсолютно не жалеет. Отважиться бы на такой шаг! Только сначала надо отрастить нормальные брови... Сюда же и волосы! Где-то полгода назад я перешла с ежедневного мытья волос на через-день, но результата никакого нет. Зато появилась привычка. Иногда, например сегодня, пользуюсь сухим шампунем, т.к. сегодня предстоит много беготни, и я точно буду мокрая. ",
        "7. Провожаю Булатова на работу, он выходит чуть раньше. Встретимся вечером!"
      ]
    },
    {
      "id": 9,
      "title": "Один мой дачный день безделья",
      "userId": 3,
      "paragraphs": [
        "Всем привет! Меня зовут Полина, мне через месяц сорокет, живу в Москве, работаю в офисе, в свободное время занимаюсь фитнесом и скалолазанием, хожу в горные походы и ПВД в лес, путешествую на электричках по маленьким городам Подмосковья. Но сегодня я покажу вам субботу 18.08.2018, один мой день аааабсолютного отдыха и тухления на даче свекров в Шатурском районе. За неделю муж упахался, т.к. занимался физическим трудом, я тоже в общем-то подустала - работа нервная, домохозяйство никто не отменял, не выношу жару и духоту большого города, и к тому же травма, полученная в горах в июле не дает мне полноценно тренироваться, и это вгоняет меня в депрессию. В общем, мы единогласно решили поехать на дачу чтобы НИЧЕГО НЕ ДЕЛАТЬ :) Это мой второй ОМД, первый тут (я больше не дизайнер славатебегосподи!) Под катом 61 фото. Извините, некоторые снимки ужасного качества, т.к. смартфон хоть и не тот же, на который я снимала первый ОМД, но уже устарел и нормально снимает только на улице в хорошую погоду и светлое время суток.",
        "Приехали в пятницу очень поздно, спать легли около 3 часов ночи, поэтому встаю дико поздно даже для меня :)",
        "1. Открываю глаза и внезапно думаю \"а не снять ли ОМД?\" Ок, делаю себяшку с Профессором",
        "2. Хотела посмотреть, что хорошего в инстаграме, но интернета нет, вот скрин-доказательство + тайм-чек",
        "3. После подъема не могу сразу бежать в туалет там, или в душ, мне нужно что-то поделать, чтобы проснуться. Например, убраться на столе. Было-Стало. ",
        "4. Смотрю на градусник: ох нифига ж себе! И это в тени! :(",
        "5. Собираю вещи в душ (размеется, как на любой классической даче советского периода, душ, туалет и кухня стоят отдельно от дома. Это очень неудобно, и очень бесит по ночам ходить через весь огород на горшок, особенно если на улице около нуля (например в октябре). По пути фиксирую себя в зеркале в \"гостиной\"."
      ]
    },
    {
      "id": 10,
      "title": "Чему нас учили в начальной школе в СССР",
      "userId": 1,
      "paragraphs": [
        "Часто приходится читать споры теоретиков советского образа жизни о качестве советского образования. Одни с пеной у рта доказывают его высокое качество, другие с еще большей пеной пытаются принизить его уровень. Я не буду вставать на чью-то сторону, а просто на конкретном примере расскажу немного о начальном образовании в 60-е годы прошлого века.",
        "Волею случая у меня в архиве оказался классный журнал 2 \"А\" класса средней школы №262 Киевского района города Москвы за 1966/1967 учебный год. Давайте вместе полистаем его странички.",
        "В \"Оглавлении\" журнала можно увидеть, что уже во втором классе мы изучали Историю, Природоведение и Географию.",
        "С левой стороны разворота журнала список учащихся с отметками. В клеточках напротив фамилии ставили букву \"Н\" с случае отсутствия ученика на уроке. Справа кратко излагали тему занятия в определенный день. Судя по этому журналу у меня была неплохая успеваемость по русскому языку.",
        "Все апрельские занятия по чтению были посвящены двум темам - весне и Ленину, потому что Ленин родился 22 апреля. Ежегодно в этот день в нашей школе проходили торжественные мероприятия, да и не только в школе. Несколько раз в разные годы в этот день нас водили всей школой в кино на просмотр фильмов про Ленина. Как раз именно в эти годы вышли известные в то время фильмы о матери Ленина \"Верность матери\" и \"Сердце матери\". В роли молодого Владимира Ульянова тогда снялся начинающий актер Родион Нахапетов.",
        "На уроках истории нам читали книгу \"Приключения доисторического мальчика\". До сих пор помню, что эти занятия мне очень нравились.",
        "А вы хорошо учились в школе?"
      ]
    }
  ],
  "comments": [
    {
      "id": 1,
      "postId": 1,
      "userId": 1,
      "text": "Отличная статья, узнал для себя много полезного"
    },
    {
      "id": 2,
      "postId": 2,
      "userId": 2,
      "text": "Статья не информативная"
    },
    {
      "id": 3,
      "postId": 3,
      "userId": 3,
      "text": "Полностью согласен с автором статьи."
    },
    {
      "id": 4,
      "postId": 1,
      "userId": 1,
      "text": "Довольно неплохо написано, но чего-то не хватает"
    },
    {
      "id": 5,
      "postId": 2,
      "userId": 2,
      "text": "Автор жжет!"
    }
  ],
  "users": [
    {
      "id": 1,
      "name": "Петр"
    },
    {
      "id": 2,
      "name": "Николай"
    },
    {
      "id": 3,
      "name": "Анатолий"
    }
  ]
}