{
  "articles": [
    {
      "id": 1,
      "link": "#",
      "title": "Верните нам разъём для наушников: почему аудио по USB-C до сих пор не работает",
      "body": "Первая проблема – отсутствие базовой совместимости. К примеру, если взять USB-C донгл, шедший в комплекте с Motorola Z2 Force или Sony Xperia XZ2, то он не будет работать с Google Pixel 2 XL, Samsung Galaxy S8 или OnePlus 6. При этом донгл из комплекта Pixel 2 XL будет работать со всеми перечисленными телефонами, как и наушники, которые идут в комплекте с Huawei P20 Pro. Но если взять донгл из коробки с Huawei P20 Pro и подключить его к Pixel 2 XL, в результате ничего не выйдет. И, да, наушники из комплекта HTC U11 тоже не заработают на многих телефонах. При таких делах иногда хочется просто растоптать наушники или донгл.",
      "categories": ["Периферия", "Звук"]
    },
    {
      "id": 2,
      "link": "#",
      "title": "iOS CSS of death",
      "body": "На github опубликован код, приводящий к force restart iOS (11/12 GM) устройств при посещении html-страницы. Также приводит к зависанию Mac OS High Sierra/Mojave при использовании Safari. Код, приводящий к force restart представляет из себя html-код с большим количеством вложенных div'ов и \"сумашедшей\" функцией размытия заднего плана:",
      "categories": ["iOS", "force restart", "bsod"]
    },
    {
      "id": 3,
      "link": "#",
      "title": "Изучаем сопромат с CalculiX",
      "body": "Метод конечных элементов (МКЭ или FEM, у них за рубежом) прочно вошел в практику инженерных расчетов при проектировании сложных систем. В значительной степени это касается прочностных расчетов механики. Применения этого метода, реализуемого соответствующим программным обеспечением существенно сокращает цикл разработки конечного устройства, позволяя исключить массу экспериментальных проверок, необходимых при использования классических расчетов на основе методов сопромата и строительной механики. На текущий момент разработана масса прикладного ПО, реализующего МКЭ. Во главе угла стоит мощный ANSYS, по бокам от него и в почетном удалении — CAD-системы со встроенным FEM-модулем (SolidWorks, Siemens NX, Creo Parametric, Компас 3D).",
      "categories": ["CAE", "сопромат", "ANSYS"]
    },
    {
      "id": 4,
      "link": "#",
      "title": "Олдскул: на чём выходили игры — обсуждаем необычные носители",
      "body": "Family Computer Disk System (FDS) — это периферийное устройство для NES, которое выпустили в 1986 году эксклюзивно для Японии. Игры для FDS выходили на особом носителе — дискете размером 2,8х3 дюйма под названием Disk Card. Объем памяти Disk Card составлял 112 КБ. Формат был основан на 3-дюймовых дискетах Mitsumi Quick Disk, который также применяли в японских домашних компьютерах и синтезаторах.",
      "categories": ["аудиомания", "звук"]
    }
  ]
}