//главное меню
export const mainMenu = ['Главная','3D графика', '2D графика', 'Контакты'];

//доп меню
export const subMenu = ['Предложить статью', 'График вебинаров', 'Записать на вебинар', 'Сообщить об ошибке'];

//Информация для статей блога
export const article = [
    {
        id: "1231",
        data: '04-12-2018',
        title: "Бесплатное обучение по 3D визуализации",
        text: "Школа 3D графики и виртуальных технологий VISSCHOOL предлагает вам зарегистрироваться",
    },
    {
        id: "1345",
        data: '12-12-2018',
        title: "Quixel выпустили Quixel Bridge 2018.4",
        text: "Состоялся релиз Quixel Bridge 2018.4. В новой версии улучшена скорость загрузки до 3,5 раз, а также включена интеграция с Maya, Unity, Unreal, Arnold, V-Ray и Redshift.",
    },
    {
        id: "8764",
        data: '15-12-2018',
        title: "Состоялся релиз Cinema 4D R20",
        text: "Стал доступен, анонсированный в августе релиз Cinema 4D R20.",
    },
    {
        id: "1235",
        data: '20-12-2018',
        title: "Релиз Instant Terra 1.2",
        text: "Wysilab выпустили Instant Terra 1.2 - обновление инструмента для генерирования 3D ландшафта.",
    },
];