//главное меню
export const mainMenu = [
    {
        title: "Главная",
        link: "/" 
    }, 
    {
        title: "Комментарии",
        link: "/comments.html" 
    },
    {
        title: "Пользователи",
        link: "/users.html" 
    }];

//доп меню
export const subMenu = ['Предложить статью', 'График вебинаров', 'Записать на вебинар', 'Сообщить об ошибке'];

//Информация для статей блога
export const article = [
    {
        id: 1231,
        data: '04-12-2018',
        title: "Бесплатное обучение по 3D визуализации",
        descr: "Школа 3D графики и виртуальных технологий VISSCHOOL предлагает вам зарегистрироваться",
        text: "Школа 3D графики и виртуальных технологий VISSCHOOL предлагает вам зарегистрироваться по ссылке и получить доступ к 35 урокам по основам работы в 3Ds Max, моделированию, текстурированию и материаловедению, визуализации в Corona и постобработке рендеров в Photoshop с бесплатной поддержкой от кураторов, помощью в установке программ и общением с сокурсниками! Миссия нашей Школы: максимально доступное обучение, увеличение количества профессионалов в области 3D графики и виртуальных технологий, целевая подготовка кадров для реализации коммерческих проектов собственной студии с трудоустройством в нее! Какие Ваши цели? - Обучиться 3D графике системно и с поддержкой? Надоело искать видеоуроки в ютубе? - Сменить профессию? Начать работать в команде нашей студии над виртуально-интерактивными проектами? - Начать больше путешествовать?  - Хорошо зарабатывать в творческой сфере на пике самых современных технологий, уделяя больше времени семье, детям? - Устроиться в самые крутые студии мира или открыть свою? - Двигаться вперед и приобретать профессию будущего - с нуля (даже если никогда ранее не открывал ни один графический редактор) до создания интерактивных локаций для шлемов виртуальной реальности?Если хотя бы одна цель Ваша, тогда добро пожаловать в нашу Школу!",
    },
    {
        id: 1345,
        data: '12-12-2018',
        title: "Quixel выпустили Quixel Bridge 2018.4",
        descr: "Состоялся релиз Quixel Bridge 2018.4. В новой версии улучшена скорость загрузки до 3,5 раз, а также включена интеграция с Maya, Unity, Unreal, Arnold, V-Ray и Redshift.",
        text: "Помимо этого был добавлен новый компактный режим для уменьшения визуального следа приложения, упрощающего стыковку с другими приложениями. Megascans Bridge включён в пакет как часть подписки Megascans. Подробную информацию можно узнать по ссылке.",
    },
    {
        id: 8764,
        data: '15-12-2018',
        title: "Состоялся релиз Cinema 4D R20",
        descr: "Стал доступен, анонсированный в августе релиз Cinema 4D R20.",
        text: "Стал доступен, анонсированный в августе релиз Cinema 4D R20. Следующее поколение трёхмерного приложения для профессионалов содержит высокопроизводительные инструменты и функции для художников визуальных эффектов и моушн-дизайнеров, включая систему материалов на основе узлов, новые инструменты моделирования на основе объёмов, мощный импорт САПР, значительное расширение набора инструментов MoGraph – и многое другое! «Мы с гордостью объявляем о доступности Cinema 4D R20 для пользователей по всему миру. Мы с нетерпением ждем первых потрясающих работ в ближайшие недели и месяцы, которые художники создадут с использованием высококачественных инструментов и функций Cinema 4D », – говорит Дэвид МакГавран, генеральный директор MAXON Computer GmbH. «Как Cinema 4D, так и набор инструментов MoGraph произвели революцию в отрасли с момента их появления. С выпуском R20 мы совершаем следующий большой прыжок вместе с нашими пользователями ».",
    },
    {
        id: 1235,
        data: '20-12-2018',
        title: "Релиз Instant Terra 1.2",
        descr: "Wysilab выпустили Instant Terra 1.2 - обновление инструмента для генерирования 3D ландшафта.",
        text: "Wysilab выпустили Instant Terra 1.2 - обновление инструмента для генерирования 3D ландшафта. Обновление представляет собой экспериментальную систему эрозии пород, которая находится в бета стадии. Новая нода симулирует движение пород под своей тяжестью: геологический процесс, называемый термической эрозией, термический ударом и т.д.Гидравлическая система эрозии также получила обновление с новыми пресетами, а также возможность экспортировать карту потока, сгенерированную симуляцией в качестве маски. Instant Terra 1.2 доступен только для Windows 7 и выше, только по подписке. Подробности можно узнать на официальном сайте.",
    },
];